app/views/students/show.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%@student = Student.find(params["id"])%>